[
  {
    "name": "POWER ENGAGE-FLEX +100 Running Sneaker For Men",
    "price": 2000,
    "brand": "Power",
    "productDetails": "EngageFlex is Power’s new lightweight running shoe. Its outsole is made of EVA and features Power’s FXS technology, molded grooves that deliver the ultimate flexible experience.",
    "img": "https://i.ibb.co/s63yZ8T/shoe-6.webp",
    "rating": 5
  },

  {
    "name": "Glide Slip-On Shoe For Juniors",
    "price": 1890,
    "brand": "Power",
    "productDetails": "These durable shoes are part of the Bubblegummers' slip-on collection to keep your kids' rapidly growing feet well cared for & stylish. Whether it's for playtime, gym class",
    "img": "https://i.ibb.co/P1K8mzh/shoe-7.webp",
    "rating": 5
  },

  {
    "name": "Power N-WALK LORI Lace-Up Performance Sneaker For Men",
    "price": 2499,
    "brand": "Power",
    "productDetails": "Update your sportswear wardrobe with a pair of this awesome lace-up performance sneaker from Power! They showcase a round toe, fine stitch detailing, lace-up fastening",
    "img": "https://i.ibb.co/sCnpXQs/shoe-9.webp",
    "rating": 5
  },

  {
    "name": "Power Alter Juniors Sports Sneaker",
    "price": 1875,
    "brand": "Power",
    "productDetails": "Power alter is Power’s new lightweight running shoe. Its outsole is made of EVA and features Power’s FXS technology, molded grooves that deliver the ultimate flexible experience.",
    "img": "https://i.ibb.co/k6WMrBb/shoe-1.webp",
    "rating": 4
  },
  {
    "name": "Power Engage Juniors Sports Sneaker",
    "price": 1990,
    "brand": "Power",
    "productDetails": "Power engage is Power’s new lightweight running shoe. Its outsole is made of EVA and features Power’s FXS technology, molded grooves that deliver the ultimate flexible experience.",
    "img": "https://i.ibb.co/F68vCBb/shoe-10.webp",
    "rating": 5
  },

  {
    "name": "Power Rush Men's Sneaker",
    "price": 2275,
    "brand": "Power",
    "productDetails": "Power rush is Power’s new lightweight running shoe. Its outsole is made of EVA and features Power’s FXS technology, molded grooves that deliver the ultimate flexible experience.",
    "img": "https://i.ibb.co/0jS0P4D/shoe-5.webp",
    "rating": 4
  },

  {
    "name": "Power SHIFT VERTEX Performance Sneaker For Men",
    "price": 2580,
    "brand": "Power",
    "productDetails": "Power shift vertex is Power’s new lightweight running shoe. Its outsole is made of EVA and features Power’s FXS technology, molded grooves that deliver the ultimate flexible experience.",
    "img": "https://i.ibb.co/FDzJSvS/shoe-2.webp",
    "rating": 5
  },

  {
    "name": "Power SHIFT VERTEX Performance Sneaker",
    "price": 2890,
    "brand": "Power",
    "productDetails": "Power shift is Power’s new lightweight running shoe. Its outsole is made of EVA and features Power’s FXS technology, molded grooves that deliver the ultimate flexible experience.",
    "img": "https://i.ibb.co/d2L9Gb6/shoe-4.webp",
    "rating": 5
  },

  {
    "name": "POWER PRO RUN Sports Sneaker For Men",
    "price": 1990,
    "brand": "Power",
    "productDetails": "Power pro run vertex is Power’s new lightweight running shoe. Its outsole is made of EVA and features Power’s FXS technology, molded grooves that deliver the ultimate flexible experience.",
    "img": "https://i.ibb.co/HVDGsh3/shoe-8.webp",
    "rating": 4.5
  },

  {
    "name": "North Star SILICE Lifestyle Sneaker For Men",
    "price": 3100,
    "brand": "Power",
    "productDetails": "North start is Power’s new lightweight running shoe. Its outsole is made of EVA and features Power’s FXS technology, molded grooves that deliver the ultimate flexible experience.",
    "img": "https://i.ibb.co/5jPDcXQ/shoe-11.webp",
    "rating": 4.5
  }

]
